agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
#include "pendant_cloud.h"

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <modem/lte_lc.h>
#include <modem/modem_key_mgmt.h>
#include <modem/nrf_modem_lib.h>
#include <nrf_modem_at.h>
#include <zephyr/fs/fs.h>
#include <zephyr/kernel.h>
#include <zephyr/net/socket.h>
#include <zephyr/net/tls_credentials.h>
#include <zephyr/posix/arpa/inet.h>
#include <zephyr/posix/netdb.h>
#include <zephyr/posix/sys/socket.h>
#include <zephyr/posix/unistd.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/util.h>

/* Owned by main.c; lets the reply poll react to Button 1. */
extern struct k_sem button_press_sem;

/* Periodic attach diagnostics: +CEREG status 3 means the network DENIED
 * registration (reject cause follows in the response), 2 means still
 * searching, and XMONITOR shows whether any cell is visible at all.
 */
static void lte_attach_probe_fn(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(lte_attach_probe_work, lte_attach_probe_fn);

static void lte_attach_probe_fn(struct k_work *work)
{
	char at_buf[240];

	ARG_UNUSED(work);
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT+CEREG?") == 0) {
		printk("LTE probe reg: %s", at_buf);
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XMONITOR") == 0) {
		printk("LTE probe cell: %s", at_buf);
	}
	/* SIM state: %XSIM: 1 means the SIM initialized fine. */
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XSIM?") == 0) {
		printk("LTE probe sim: %s", at_buf);
	}
	/* Signal: +CESQ last field 255 means no measurable signal (antenna). */
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT+CESQ") == 0) {
		printk("LTE probe signal: %s", at_buf);
	}
	if (nrf_modem_at_cmd(at_buf, sizeof(at_buf), "AT%%XICCID") == 0) {
		printk("LTE probe iccid: %s", at_buf);
	}
	k_work_schedule(&lte_attach_probe_work, K_SECONDS(15));
}

#define RELAY_HOSTNAME \
	"ai-pendant-mission-control.evan20050827.workers.dev"
#define RELAY_PORT "443"
#define TRANSCRIBE_PATH "/v1/transcribe"
#define MAC_PLAN_PATH "/v1/mac/plan"
#define PENDANT_EVENT_PATH_PREFIX "/v1/pendant/jobs/"
#define PENDANT_EVENT_PATH_SUFFIX "/events"
#define PENDANT_DEVICE_ID "nrf9160-pendant"

#define TLS_SECURITY_TAG 193
#define TLS_VERIFY_REQUIRED 2
#define HTTP_RESPONSE_SIZE 4096U
#define HTTP_HEADER_SIZE 768U
#define FILE_READ_SIZE 384U
#define BASE64_SEND_SIZE 512U
#define TRANSCRIPT_JSON_SIZE 2048U
#define JOB_ID_SIZE 80U
#define PLAN_SUFFIX_SIZE 416U
#define PENDANT_EVENT_BODY_SIZE 512U
#define HTTP_STREAM_HEADER_SIZE 1536U
#define HTTP_STREAM_READ_SIZE 4096U
#define MAX_PCM_BYTES (8U * 1024U * 1024U)
#define AGENT_REPLY_POLL_ATTEMPTS 30U

static const char relay_ca_certificate[] = {
#include "globalsign_root_ca.pem.inc"
	0x00
};

static const char transcription_prefix[] = "{\"audioBase64\":\"";
static const char transcription_suffix[] =
	"\",\"format\":\"ogg\",\"language\":\"en\"}";
static const char plan_prefix[] = "{\"command\":";
static const char base64_alphabet[] =
	"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

static char http_response[HTTP_RESPONSE_SIZE];
static char transcript_json[TRANSCRIPT_JSON_SIZE];
static char transcription_job_id[JOB_ID_SIZE];
static char mac_job_id[JOB_ID_SIZE];
static char announced_job_id[JOB_ID_SIZE];
static uint8_t http_stream_buffer[HTTP_STREAM_READ_SIZE];
static bool cloud_initialized;
static bool radio_suspended;

volatile int pendant_cloud_init_result = -EAGAIN;
volatile int pendant_cloud_transcribe_result = -EAGAIN;
volatile int pendant_cloud_dispatch_result = -EAGAIN;
volatile int pendant_cloud_reply_result = -EAGAIN;
volatile int pendant_cloud_last_http_status;
volatile uint32_t pendant_cloud_uploaded_pcm_bytes;
volatile uint32_t pendant_cloud_reply_pcm_bytes;
volatile uint32_t pendant_cloud_reply_sample_rate = 24000U;
volatile enum pendant_cloud_audio_format pendant_cloud_reply_format =
	PENDANT_CLOUD_AUDIO_UNKNOWN;

BUILD_ASSERT(sizeof(relay_ca_certificate) < KB(4),
	     "Relay root certificate unexpectedly large");

static int send_all(int fd, const void *data, size_t length)
{
	const uint8_t *bytes = data;
	size_t offset = 0U;

	while (offset < length) {
		ssize_t sent = send(fd, bytes + offset, length - offset, 0);

		if (sent < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (sent == 0) {
			return -ECONNRESET;
		}
		offset += (size_t)sent;
	}

	return 0;
}

static int provision_relay_certificate(void)
{
	bool exists = false;
	int error = modem_key_mgmt_exists(
		TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN, &exists);

	if (error != 0) {
		return error;
	}

	if (exists) {
		error = modem_key_mgmt_cmp(
			TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
			relay_ca_certificate, sizeof(relay_ca_certificate));
		if (error == 0) {
			printk("Relay CA certificate already provisioned\n");
			return 0;
		}

		error = modem_key_mgmt_delete(
			TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN);
		if (error != 0) {
			return error;
		}
	}

	error = modem_key_mgmt_write(
		TLS_SECURITY_TAG, MODEM_KEY_MGMT_CRED_TYPE_CA_CHAIN,
		relay_ca_certificate, sizeof(relay_ca_certificate));
	if (error == 0) {
		printk("Relay CA certificate provisioned\n");
	}
	return error;
}

static int configure_tls_socket(int fd)
{
	const sec_tag_t security_tags[] = { TLS_SECURITY_TAG };
	int verify = TLS_VERIFY_REQUIRED;
	int error;

	error = setsockopt(fd, SOL_TLS, TLS_PEER_VERIFY,
			   &verify, sizeof(verify));
	if (error != 0) {
		return -errno;
	}

	error = setsockopt(fd, SOL_TLS, TLS_SEC_TAG_LIST,
			   security_tags, sizeof(security_tags));
	if (error != 0) {
		return -errno;
	}

	error = setsockopt(fd, SOL_TLS, TLS_HOSTNAME,
			   RELAY_HOSTNAME, sizeof(RELAY_HOSTNAME) - 1U);
	if (error != 0) {
		return -errno;
	}

#if defined(TLS_SESSION_CACHE) && defined(TLS_SESSION_CACHE_ENABLED)
	/* Session resumption keeps the small announce POST that follows a
	 * recording under a second by skipping the full TLS handshake.
	 * Best effort: some modem firmware revisions reject the option.
	 */
	{
		int session_cache = TLS_SESSION_CACHE_ENABLED;

		(void)setsockopt(fd, SOL_TLS, TLS_SESSION_CACHE,
				 &session_cache, sizeof(session_cache));
	}
#endif

