agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	return 0;
}

static int open_relay_socket(void)
{
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM,
	};
	int last_error = -EHOSTUNREACH;

	/*
	 * Cloud Run publishes several IPv4 addresses. A cellular route can
	 * occasionally refuse one address while the others remain reachable,
	 * so try every answer and refresh DNS before failing the voice cycle.
	 */
	for (unsigned int attempt = 1U; attempt <= 3U; ++attempt) {
		struct addrinfo *result = NULL;
		int error = getaddrinfo(RELAY_HOSTNAME, RELAY_PORT,
					&hints, &result);

		if (error != 0 || result == NULL) {
			printk("Relay DNS attempt %u failed: %d errno=%d\n",
			       attempt, error, errno);
			last_error = error != 0 ? -EHOSTUNREACH : -ENOENT;
		} else {
			unsigned int candidate_number = 0U;

			for (struct addrinfo *candidate = result;
			     candidate != NULL; candidate = candidate->ai_next) {
				char address[INET_ADDRSTRLEN] = "?";
				int fd;

				++candidate_number;
				(void)inet_ntop(
					AF_INET,
					&((struct sockaddr_in *)
						  candidate->ai_addr)->sin_addr,
					address, sizeof(address));
				printk("Relay DNS candidate %u.%u: %s\n",
				       attempt, candidate_number, address);
				fd = socket(candidate->ai_family, SOCK_STREAM,
					    IPPROTO_TLS_1_2);
				if (fd < 0) {
					last_error = -errno;
					printk("Relay socket attempt %u.%u failed: %d\n",
					       attempt, candidate_number, last_error);
					continue;
				}

				error = configure_tls_socket(fd);
				if (error == 0 &&
				    connect(fd, candidate->ai_addr,
					    candidate->ai_addrlen) == 0) {
					printk("Relay TLS connected on attempt %u.%u\n",
					       attempt, candidate_number);
					freeaddrinfo(result);
					return fd;
				}

				last_error = error != 0 ? error : -errno;
				printk("Relay TLS attempt %u.%u failed: %d "
				       "(errno=%d)\n",
				       attempt, candidate_number, last_error, errno);
				close(fd);

				/*
				 * Distinguish a carrier/IP routing failure from a
				 * TLS handshake or credential failure.
				 */
				fd = socket(candidate->ai_family, SOCK_STREAM,
					    IPPROTO_TCP);
				if (fd >= 0) {
					error = connect(fd, candidate->ai_addr,
							candidate->ai_addrlen);
					printk("Relay plain TCP diagnostic %u.%u: "
					       "%s (errno=%d)\n",
					       attempt, candidate_number,
					       error == 0 ? "connected" :
					       "failed", errno);
					close(fd);
				}
			}
		}

		if (result != NULL) {
			freeaddrinfo(result);
		}
		if (attempt < 3U) {
			k_sleep(K_SECONDS(2));
		}
	}

	return last_error;
}

static int receive_http_response(int fd)
{
	size_t offset = 0U;

	while (offset < sizeof(http_response) - 1U) {
		ssize_t received = recv(fd, http_response + offset,
					sizeof(http_response) - 1U - offset, 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			break;
		}
		offset += (size_t)received;
	}
	http_response[offset] = '\0';

	const char *status = strchr(http_response, ' ');

	if (status == NULL) {
		return -EBADMSG;
	}
	pendant_cloud_last_http_status = atoi(status + 1);
	printk("Relay HTTP status: %d, response bytes: %u\n",
	       pendant_cloud_last_http_status, (uint32_t)offset);

	if (pendant_cloud_last_http_status < 200 ||
	    pendant_cloud_last_http_status >= 300) {
		const char *body = strstr(http_response, "\r\n\r\n");

		printk("Relay error: %s\n", body == NULL ? "(no body)" : body + 4);
		return -EREMOTE;
	}

	return 0;
}

static int send_http_post_header(int fd, const char *path,
				 const char *content_type,
				 size_t content_length)
{
	char header[HTTP_HEADER_SIZE];
	int length = snprintf(
		header, sizeof(header),
		"POST %s HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Content-Type: %s\r\n"
		"Content-Length: %lu\r\n"
		"Connection: close\r\n\r\n",
		path, RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY,
		content_type, (unsigned long)content_length);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

static int send_http_get_header(int fd, const char *path)
{
	char header[HTTP_HEADER_SIZE];
	int length = snprintf(
		header, sizeof(header),
		"GET %s HTTP/1.1\r\n"
		"Host: %s\r\n"
		"Authorization: Bearer %s\r\n"
		"Accept: audio/ogg, audio/pcm, application/json\r\n"
		"Connection: close\r\n\r\n",
		path, RELAY_HOSTNAME, CONFIG_PENDANT_RELAY_API_KEY);

	if (length < 0 || (size_t)length >= sizeof(header)) {
		return -EOVERFLOW;
	}
	return send_all(fd, header, (size_t)length);
}

struct base64_stream {
	int fd;
	uint8_t carry[3];
	uint8_t carry_length;
	char output[BASE64_SEND_SIZE];
	size_t output_length;
};

static int base64_flush(struct base64_stream *stream)
{
	int error;

	if (stream->output_length == 0U) {
		return 0;
	}
	error = send_all(stream->fd, stream->output, stream->output_length);
	if (error == 0) {
		stream->output_length = 0U;
	}
	return error;
}

static int base64_emit(struct base64_stream *stream, uint8_t count)
{
	const uint8_t byte0 = stream->carry[0];
	const uint8_t byte1 = count > 1U ? stream->carry[1] : 0U;
	const uint8_t byte2 = count > 2U ? stream->carry[2] : 0U;

	if (stream->output_length + 4U > sizeof(stream->output)) {
		int error = base64_flush(stream);

		if (error != 0) {
			return error;
		}
	}

	stream->output[stream->output_length++] =
		base64_alphabet[byte0 >> 2];
	stream->output[stream->output_length++] =
		base64_alphabet[((byte0 & 0x03U) << 4) | (byte1 >> 4)];
	stream->output[stream->output_length++] =
		count > 1U
			? base64_alphabet[((byte1 & 0x0fU) << 2) |
					  (byte2 >> 6)]
			: '=';
	stream->output[stream->output_length++] =
		count > 2U ? base64_alphabet[byte2 & 0x3fU] : '=';
	stream->carry_length = 0U;
	return 0;
}

static int base64_feed(struct base64_stream *stream,
		       const uint8_t *data, size_t length)
{
	for (size_t index = 0U; index < length; ++index) {
		stream->carry[stream->carry_length++] = data[index];
		if (stream->carry_length == 3U) {
			int error = base64_emit(stream, 3U);

			if (error != 0) {
				return error;
			}
		}
	}
	return 0;
}

static int base64_finish(struct base64_stream *stream)
{
	int error = 0;

