agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	if (stream->carry_length != 0U) {
		error = base64_emit(stream, stream->carry_length);
	}
	return error == 0 ? base64_flush(stream) : error;
}

static int post_recording(const char *audio_path, uint32_t source_pcm_bytes)
{
	struct fs_dirent entry;
	struct fs_file_t file;
	uint8_t file_bytes[FILE_READ_SIZE];
	struct base64_stream encoder = { 0 };
	size_t base64_bytes;
	size_t body_bytes;
	uint32_t bytes_read_total = 0U;
	int fd = -1;
	int error;

	error = fs_stat(audio_path, &entry);
	if (error != 0) {
		printk("Cloud upload SD stat failed for %s: %d\n",
		       audio_path, error);
		return error;
	}
	if (entry.type != FS_DIR_ENTRY_FILE || entry.size == 0U ||
	    entry.size > MAX_PCM_BYTES || source_pcm_bytes == 0U) {
		printk("Cloud upload rejected SD file: type=%u size=%u\n",
		       (unsigned int)entry.type, (uint32_t)entry.size);
		return -EINVAL;
	}
	printk("Cloud upload found %u Ogg Opus bytes on SD\n",
	       (uint32_t)entry.size);

	/* When a pre-upload announce succeeded, reference its job so the
	 * relay attaches this audio to the already-visible entry instead
	 * of creating a second one.
	 */
	char dynamic_prefix[JOB_ID_SIZE + 32];
	int prefix_length;

	if (announced_job_id[0] != '\0') {
		prefix_length = snprintf(
			dynamic_prefix, sizeof(dynamic_prefix),
			"{\"jobId\":\"%s\",\"audioBase64\":\"",
			announced_job_id);
	} else {
		prefix_length = snprintf(dynamic_prefix,
					 sizeof(dynamic_prefix), "%s",
					 transcription_prefix);
	}
	if (prefix_length < 0 ||
	    (size_t)prefix_length >= sizeof(dynamic_prefix)) {
		return -EOVERFLOW;
	}

	base64_bytes = ((entry.size + 2U) / 3U) * 4U;
	body_bytes = (size_t)prefix_length + base64_bytes +
		     sizeof(transcription_suffix) - 1U;

	fd = open_relay_socket();
	if (fd < 0) {
		printk("Cloud upload could not open relay socket: %d\n", fd);
		return fd;
	}

	error = send_http_post_header(fd, TRANSCRIBE_PATH,
				      "application/json", body_bytes);
	if (error != 0) {
		printk("Cloud upload HTTP header failed: %d\n", error);
		goto out;
	}
	error = send_all(fd, dynamic_prefix, (size_t)prefix_length);
	if (error != 0) {
		printk("Cloud upload JSON prefix failed: %d\n", error);
		goto out;
	}

	encoder.fd = fd;
	fs_file_t_init(&file);
	error = fs_open(&file, audio_path, FS_O_READ);
	if (error != 0) {
		goto out;
	}

	while (true) {
		ssize_t count = fs_read(&file, file_bytes, sizeof(file_bytes));

		if (count < 0) {
			error = (int)count;
			break;
		}
		if (count == 0) {
			break;
		}
		error = base64_feed(&encoder, file_bytes, (size_t)count);
		if (error != 0) {
			break;
		}
		bytes_read_total += (uint32_t)count;
	}
	(void)fs_close(&file);
	if (error != 0) {
		goto out;
	}
	if (bytes_read_total != entry.size) {
		error = -EIO;
		goto out;
	}

	error = base64_finish(&encoder);
	if (error != 0) {
		goto out;
	}
	error = send_all(fd, transcription_suffix,
			 sizeof(transcription_suffix) - 1U);
	if (error != 0) {
		goto out;
	}

	pendant_cloud_uploaded_pcm_bytes = source_pcm_bytes;
	printk("Uploaded %u Ogg Opus bytes representing %u PCM bytes\n",
	       bytes_read_total, pendant_cloud_uploaded_pcm_bytes);
	error = receive_http_response(fd);

out:
	close(fd);
	return error;
}

static int copy_transcript_json_string(void)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *cursor;
	bool escaped = false;

	if (body == NULL) {
		return -EBADMSG;
	}
	key = strstr(body + 4, "\"text\"");
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + sizeof("\"text\"") - 1U, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}

	for (cursor = start + 1; *cursor != '\0'; ++cursor) {
		if (escaped) {
			escaped = false;
			continue;
		}
		if (*cursor == '\\') {
			escaped = true;
			continue;
		}
		if (*cursor == '"') {
			size_t length = (size_t)(cursor - start + 1);

			if (length >= sizeof(transcript_json)) {
				return -E2BIG;
			}
			memcpy(transcript_json, start, length);
			transcript_json[length] = '\0';
			printk("Remote transcript: %s\n", transcript_json);
			return 0;
		}
	}

	return -EBADMSG;
}

static int copy_json_string_value(const char *key_name,
				  char *destination,
				  size_t destination_size)
{
	const char *body = strstr(http_response, "\r\n\r\n");
	const char *key;
	const char *start;
	const char *end;
	char quoted_key[48];
	int key_length;

	if (body == NULL) {
		return -EBADMSG;
	}
	key_length = snprintf(quoted_key, sizeof(quoted_key), "\"%s\"",
			      key_name);
	if (key_length < 0 || (size_t)key_length >= sizeof(quoted_key)) {
		return -EOVERFLOW;
	}
	key = strstr(body + 4, quoted_key);
	if (key == NULL) {
		return -ENODATA;
	}
	start = strchr(key + key_length, ':');
	if (start == NULL) {
		return -EBADMSG;
	}
	do {
		++start;
	} while (*start == ' ' || *start == '\t' || *start == '\r' ||
		 *start == '\n');
	if (*start != '"') {
		return -EBADMSG;
	}
	++start;
	end = strchr(start, '"');
	if (end == NULL) {
		return -EBADMSG;
	}

	size_t length = (size_t)(end - start);

	if (length == 0U || length >= destination_size) {
		return length == 0U ? -ENODATA : -E2BIG;
	}
	memcpy(destination, start, length);
	destination[length] = '\0';
	return 0;
}

static int dispatch_transcript_to_mac(uint32_t sample_rate)
{
	char plan_suffix[PLAN_SUFFIX_SIZE];
	const size_t transcript_length = strlen(transcript_json);
	uint32_t duration_ms;
	int suffix_length;
	size_t body_length;
	int fd;
	int error;

	if (sample_rate == 0U) {
		return -EINVAL;
	}
	duration_ms = (uint32_t)(
		((uint64_t)pendant_cloud_uploaded_pcm_bytes * 1000U) /
		((uint64_t)sample_rate * sizeof(int16_t)));
	suffix_length = snprintf(
		plan_suffix, sizeof(plan_suffix),
		",\"deviceId\":\"" PENDANT_DEVICE_ID "\","
		"\"transcriptionJobId\":\"%s\","
			"\"inputTelemetry\":{"
			"\"audioBytes\":%u,"
			"\"format\":\"ogg-opus\","
		"\"sampleRate\":%u,"
		"\"channels\":1,"
		"\"bitsPerSample\":16,"
		"\"inputGainDb\":0,"
		"\"durationMs\":%u,"
		"\"storage\":\"microSD\","
			"\"uploadedFormat\":\"ogg\"}}",
		transcription_job_id, pendant_cloud_uploaded_pcm_bytes,
		sample_rate, duration_ms);
	if (suffix_length < 0 ||
	    (size_t)suffix_length >= sizeof(plan_suffix)) {
		return -EOVERFLOW;
	}

	body_length = sizeof(plan_prefix) - 1U +
		      transcript_length + (size_t)suffix_length;

	fd = open_relay_socket();
	if (fd < 0) {
		return fd;
	}

