agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	error = send_http_post_header(fd, MAC_PLAN_PATH,
				      "application/json", body_length);
	if (error == 0) {
		error = send_all(fd, plan_prefix, sizeof(plan_prefix) - 1U);
	}
	if (error == 0) {
		error = send_all(fd, transcript_json, transcript_length);
	}
	if (error == 0) {
		error = send_all(fd, plan_suffix, (size_t)suffix_length);
	}
	if (error == 0) {
		error = receive_http_response(fd);
	}

	close(fd);
	return error;
}

static int post_pendant_event(const char *stage, const char *status,
			      const char *label, const char *detail,
			      int result)
{
	char path[192];
	char body[PENDANT_EVENT_BODY_SIZE];
	int previous_http_status = pendant_cloud_last_http_status;
	int path_length;
	int body_length;
	int fd;
	int error;

	if (mac_job_id[0] == '\0') {
		return -ENODATA;
	}

	path_length = snprintf(
		path, sizeof(path), "%s%s%s",
		PENDANT_EVENT_PATH_PREFIX, mac_job_id,
		PENDANT_EVENT_PATH_SUFFIX);
	if (path_length < 0 || (size_t)path_length >= sizeof(path)) {
		return -EOVERFLOW;
	}

	body_length = snprintf(
		body, sizeof(body),
		"{\"stage\":\"%s\","
		"\"status\":\"%s\","
		"\"label\":\"%s\","
		"\"detail\":\"%s\","
		"\"meta\":{"
		"\"pcmBytes\":%u,"
		"\"sampleRate\":%u,"
		"\"channels\":1,"
		"\"bitsPerSample\":16,"
		"\"storage\":\"microSD\","
		"\"transport\":\"I2S\","
		"\"result\":%d}}",
		stage, status, label, detail,
		pendant_cloud_reply_pcm_bytes,
		pendant_cloud_reply_sample_rate, result);
	if (body_length < 0 || (size_t)body_length >= sizeof(body)) {
		return -EOVERFLOW;
	}

	fd = open_relay_socket();
	if (fd < 0) {
		return fd;
	}
	error = send_http_post_header(
		fd, path, "application/json", (size_t)body_length);
	if (error == 0) {
		error = send_all(fd, body, (size_t)body_length);
	}
	if (error == 0) {
		error = receive_http_response(fd);
	}
	close(fd);
	pendant_cloud_last_http_status = previous_http_status;
	return error;
}

int pendant_cloud_announce_recording(uint32_t pcm_bytes,
				     uint32_t sample_rate)
{
	char body[192];
	int body_length;
	int fd;
	int error;

	announced_job_id[0] = '\0';
	if (!cloud_initialized) {
		return -ENOTCONN;
	}

	body_length = snprintf(
		body, sizeof(body),
			"{\"deviceId\":\"nrf9160-pendant\","
			"\"pcmBytes\":%u,"
			"\"sampleRate\":%u,"
			"\"format\":\"ogg-opus\"}",
		pcm_bytes, sample_rate);
	if (body_length < 0 || (size_t)body_length >= sizeof(body)) {
		return -EOVERFLOW;
	}

	fd = open_relay_socket();
	if (fd < 0) {
		return fd;
	}
	error = send_http_post_header(
		fd, "/v1/pendant/announce", "application/json",
		(size_t)body_length);
	if (error == 0) {
		error = send_all(fd, body, (size_t)body_length);
	}
	if (error == 0) {
		error = receive_http_response(fd);
	}
	close(fd);
	if (error == 0) {
		error = copy_json_string_value(
			"jobId", announced_job_id, sizeof(announced_job_id));
		if (error != 0) {
			announced_job_id[0] = '\0';
		}
	}
	printk("Recording announced: result=%d job=%s\n",
	       error, announced_job_id[0] != '\0' ? announced_job_id : "-");
	return error;
}

struct pcm_writer {
	struct fs_file_t *file;
	uint8_t output[FILE_READ_SIZE];
	size_t output_length;
	size_t written_bytes;
};

struct http_body_reader {
	int fd;
	const uint8_t *initial;
	size_t initial_length;
	size_t initial_offset;
	size_t buffer_length;
	size_t buffer_offset;
};

static int pcm_writer_flush(struct pcm_writer *writer)
{
	if (writer->output_length == 0U) {
		return 0;
	}

	ssize_t written = fs_write(writer->file, writer->output,
				   writer->output_length);

	if (written != (ssize_t)writer->output_length) {
		return written < 0 ? (int)written : -EIO;
	}
	writer->written_bytes += writer->output_length;
	writer->output_length = 0U;
	return 0;
}

static int pcm_writer_emit(struct pcm_writer *writer, uint8_t value)
{
	if (writer->written_bytes + writer->output_length >= MAX_PCM_BYTES) {
		return -EFBIG;
	}
	if (writer->output_length == sizeof(writer->output)) {
		int error = pcm_writer_flush(writer);

		if (error != 0) {
			return error;
		}
	}
	writer->output[writer->output_length++] = value;
	return 0;
}

static int http_body_next(struct http_body_reader *reader, uint8_t *value)
{
	if (reader->initial_offset < reader->initial_length) {
		*value = reader->initial[reader->initial_offset++];
		return 1;
	}
	if (reader->buffer_offset < reader->buffer_length) {
		*value = http_stream_buffer[reader->buffer_offset++];
		return 1;
	}

	while (true) {
		ssize_t received = recv(reader->fd, http_stream_buffer,
					sizeof(http_stream_buffer), 0);

		if (received < 0) {
			if (errno == EINTR) {
				continue;
			}
			return -errno;
		}
		if (received == 0) {
			return 0;
		}
		reader->buffer_length = (size_t)received;
		reader->buffer_offset = 1U;
		*value = http_stream_buffer[0];
		return 1;
	}
}

static int read_required_body_byte(struct http_body_reader *reader,
				   uint8_t *value)
{
	int result = http_body_next(reader, value);

	return result > 0 ? 0 : (result == 0 ? -ECONNRESET : result);
}

static int receive_chunked_pcm(struct http_body_reader *reader,
			       struct pcm_writer *writer)
{
	while (true) {
		char size_line[24];
		size_t size_length = 0U;
		uint8_t character;
		int error;

		while (true) {
			error = read_required_body_byte(reader, &character);
			if (error != 0) {
				return error;
			}
			if (character == '\r') {
				break;
			}
			if (size_length + 1U >= sizeof(size_line)) {
				return -EOVERFLOW;
			}
			size_line[size_length++] = (char)character;
		}
		size_line[size_length] = '\0';
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\n') {
			return error != 0 ? error : -EBADMSG;
		}

		char *extension = strchr(size_line, ';');
		if (extension != NULL) {
			*extension = '\0';
		}
		char *end = NULL;
		unsigned long chunk_size = strtoul(size_line, &end, 16);
		if (end == size_line || *end != '\0') {
			return -EBADMSG;
		}
		if (chunk_size == 0U) {
			return 0;
		}

		for (unsigned long index = 0U; index < chunk_size; ++index) {
			error = read_required_body_byte(reader, &character);
			if (error != 0) {
				return error;
			}
			error = pcm_writer_emit(writer, character);
			if (error != 0) {
				return error;
			}
		}
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\r') {
			return error != 0 ? error : -EBADMSG;
		}
		error = read_required_body_byte(reader, &character);
		if (error != 0 || character != '\n') {
			return error != 0 ? error : -EBADMSG;
		}
	}
}

