agenticaiuw/hivemind/firmware/nrf9160/src/pendant_cloud.c
	pendant_cloud_transcribe_result = -EAGAIN;
	pendant_cloud_dispatch_result = -EAGAIN;
	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_last_http_status = 0;
	pendant_cloud_uploaded_pcm_bytes = 0U;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	transcription_job_id[0] = '\0';
	mac_job_id[0] = '\0';

	if (!cloud_initialized) {
		error = pendant_cloud_init();
		if (error != 0) {
			return error;
		}
	}

	error = post_recording(audio_path, source_pcm_bytes);
	pendant_cloud_transcribe_result = error;
	if (error != 0) {
		return error;
	}

	error = copy_transcript_json_string();
	if (error != 0) {
		pendant_cloud_transcribe_result = error;
		return error;
	}
	error = copy_json_string_value(
		"jobId", transcription_job_id,
		sizeof(transcription_job_id));
	if (error != 0) {
		pendant_cloud_transcribe_result = error;
		return error;
	}

	error = dispatch_transcript_to_mac(sample_rate);
	pendant_cloud_dispatch_result = error;
	if (error == 0) {
		error = copy_json_string_value(
			"jobId", mac_job_id, sizeof(mac_job_id));
		if (error != 0) {
			pendant_cloud_dispatch_result = error;
			return error;
		}
		printk("Transcript queued for Mac job %s\n", mac_job_id);
	}
	return error;
}

int pendant_cloud_wait_for_agent_reply(const char *pcm_path)
{
	char path[192];
	int error;

	pendant_cloud_reply_result = -EAGAIN;
	pendant_cloud_reply_pcm_bytes = 0U;
	pendant_cloud_reply_format = PENDANT_CLOUD_AUDIO_UNKNOWN;
	if (!cloud_initialized || mac_job_id[0] == '\0') {
		pendant_cloud_reply_result = -ENODATA;
		return pendant_cloud_reply_result;
	}

	int length = snprintf(
		path, sizeof(path),
		"/v1/pendant/jobs/%s/speech?waitMs=25000",
		mac_job_id);

	if (length < 0 || (size_t)length >= sizeof(path)) {
		pendant_cloud_reply_result = -EOVERFLOW;
		return pendant_cloud_reply_result;
	}

	for (unsigned int attempt = 1U;
	     attempt <= AGENT_REPLY_POLL_ATTEMPTS; ++attempt) {
		int fd = open_relay_socket();

		if (fd < 0) {
			error = fd;
			continue;
		}
		error = send_http_get_header(fd, path);
		if (error == 0) {
			error = receive_agent_job_speech(fd, pcm_path);
		}
		close(fd);

		if (error == 0) {
			pendant_cloud_reply_result = 0;
			int event_error = post_pendant_event(
				"reply_downloaded", "done",
				"Reply downloaded to pendant",
				"Agent response audio was written to microSD.",
				0);

			if (event_error != 0) {
				printk("Reply telemetry failed: %d\n",
				       event_error);
			}
			return 0;
		}
		if (error != -EAGAIN) {
			break;
		}
		/* A button press abandons the reply so a new recording can
		 * start immediately instead of riding out the full poll.
		 */
		if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
			pendant_cloud_reply_result = -ECANCELED;
			return -ECANCELED;
		}
		printk("Agent reply is not ready; polling again (%u/%u)\n",
		       attempt, AGENT_REPLY_POLL_ATTEMPTS);
		k_sleep(K_SECONDS(1));
	}

	pendant_cloud_reply_result = error;
	return error;
}

int pendant_cloud_report_playback_started(void)
{
	return post_pendant_event(
		"device_playback", "active",
		"Bluetooth playback started",
		"Pendant started transmitting response PCM over I2S.",
		0);
}

int pendant_cloud_report_playback_result(int playback_result)
{
	if (playback_result == 0) {
		return post_pendant_event(
			"device_playback", "done",
			"Bluetooth playback completed",
			"Pendant finished transmitting response PCM over I2S.",
			0);
	}

	return post_pendant_event(
		"device_playback", "failed",
		"Bluetooth playback failed",
		"Pendant I2S playback returned an error.",
		playback_result);
}

int pendant_cloud_set_job_id_for_diagnostic(const char *job_id)
{
	size_t length;

	if (job_id == NULL) {
		return -EINVAL;
	}
	length = strlen(job_id);
	if (length == 0U || length >= sizeof(mac_job_id)) {
		return -EINVAL;
	}
	memcpy(mac_job_id, job_id, length + 1U);
	return 0;
}
